# 1. Raw Connection to Database
!pip install mysql-connector-python

In [1]:
import pandas as pd
import mysql.connector

# Establish a connection to the MySQL database
connection = mysql.connector.connect(
    user='root',
    password='Admin260',
    host='localhost',
    database='moviesdb'
)

# Create a cursor object to execute SQL queries
cursor = connection.cursor()

# Define the SQL query
query = """
    SELECT * FROM movies
"""

# Execute the SQL query
cursor.execute(query)

# Fetch all the results and store them in a list
results = cursor.fetchall()

# Close the cursor and connection
cursor.close()
connection.close()

# Create a DataFrame from the fetched results
df1 = pd.DataFrame(results)

# Rename the columns of the DataFrame
df1.columns = ['movie_id', 'title', 'industry', 'release_year', 'imdb_rating',
               'studio', 'language_id']

# Display the DataFrame
df1.head(1)

,movie_id,title,industry,release_year,imdb_rating,studio,language_id
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3

# 2. Best way to do the same 

* !pip install mysql-connector-python
* !pip install ipython-sql pandas

In [2]:
%load_ext sql
mysql_conn_str = "mysql+mysqlconnector://root:Admin260@localhost/moviesdb"
%sql $mysql_conn_str

# Check the MySQL version
%sql SELECT version();

 * mysql+mysqlconnector://root:***@localhost/moviesdb
1 rows affected.

[('8.3.0',)]

In [3]:
# Fetch data from the database and store it in a DataFrame
sqldata = %sql SELECT m.*, f.budget,f.revenue \
                FROM movies m JOIN financials f ON m.movie_id = f.movie_id
df2 = sqldata.DataFrame()

 * mysql+mysqlconnector://root:***@localhost/moviesdb
37 rows affected.

In [4]:
df2.head(1)

,movie_id,title,industry,release_year,imdb_rating,studio,language_id,budget,revenue
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3,1.00,12.50

# 3. Pandas read_sql
* https://docs.sqlalchemy.org/en/20/
* https://docs.sqlalchemy.org/en/20/core/engines.html
* !pip install pymysql

In [5]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine

# Print SQLAlchemy version
print("sqlalchemy version:", sqlalchemy.__version__)

# Define the connection string
con_string = 'mysql+pymysql://root:Admin260@localhost/moviesdb'

# Create an SQLAlchemy engine
engine = create_engine(con_string)

sqlalchemy version: 2.0.28

In [6]:
# Define the SQL query
query = """
select 
 m.studio, m.movie_id, sum(f.budget) as total_budget, sum(f.revenue) as total_revenue

from movies m 
join financials f 
on m.movie_id = f.movie_id
group by m.studio , m.movie_id;
"""
df3 = pd.read_sql(query, engine)
df3.head(1)

          studio  movie_id  total_budget  total_revenue
0  Hombale Films       101           1.0           12.5

# Writing to the Database

## Table1

In [7]:
# Group by  industry, and studio to get maximum IMDb rating
max_rated_studio =  df2.groupby(['industry', 'studio'])["imdb_rating"].max().reset_index()

# Write the DataFrame to the MySQL database (assuming 'max_rated_studio' are table names)
max_rated_studio.to_sql('max_rated_studio', engine, if_exists='replace', index=False)


pd.read_sql('select * from max_rated_studio', engine).head(3)

    industry             studio imdb_rating
0  Bollywood                            8.3
1  Bollywood   Arka Media Works         8.0
2  Bollywood  DVV Entertainment         8.0

# Table 2

In [8]:
# Define the SQL query to fetch data and calculate totals
query = """
SELECT 
    m.studio,
    m.movie_id,
    SUM(f.budget) AS total_budget,
    SUM(f.revenue) AS total_revenue
FROM
    movies m
JOIN
    financials f ON m.movie_id = f.movie_id
GROUP BY
    m.studio, m.movie_id;
"""

# Execute the SQL query and read the result into a DataFrame
df_read_sql = pd.read_sql(query, engine)

# Assign the DataFrame to a new variable for clarity
df = df_read_sql

# Save the DataFrame to a MySQL table named "revenue_studio_wise"
df.to_sql("revenue_studio_wise", engine, if_exists='replace', index=False)

pd.read_sql('select * from revenue_studio_wise', engine).head(3)

           studio  movie_id  total_budget  total_revenue
0   Hombale Films       101           1.0           12.5
1  Marvel Studios       102         200.0          954.8
2  Marvel Studios       103         165.0          644.8

In [9]:
pd.read_sql('show tables',engine)

    Tables_in_moviesdb
0               actors
1           financials
2            languages
3     max_rated_studio
4          movie_actor
5               movies
6  revenue_studio_wise

# to_sql appending a table

# Example 1

In [10]:
import pandas as pd
from sqlalchemy import create_engine

# Create SQLAlchemy engine
engine = create_engine('mysql+pymysql://root:Admin260@localhost/moviesdb')

# Assuming 'max_rated_studio' is a DataFrame containing the data from the 'max_rated_studio' table
studio_max = max_rated_studio.copy()

# Update the 'imdb_rating' column by adding 1000 to each value
studio_max['imdb_rating'] = studio_max['imdb_rating'] + 1000

# Append the modified DataFrame to the 'max_rated_studio' table in the database
studio_max.to_sql('max_rated_studio', engine, index=False, if_exists='append')

# Read the data from the 'max_rated_studio' table in the database
pd.read_sql('select * from max_rated_studio', engine)

     industry                     studio imdb_rating
0   Bollywood                                    8.3
1   Bollywood           Arka Media Works         8.0
2   Bollywood          DVV Entertainment         8.0
3   Bollywood         Dharma Productions         8.4
4   Bollywood  Government of West Bengal         8.3
5   Bollywood              Hombale Films         8.4
6   Bollywood        Mythri Movie Makers         7.6
7   Bollywood          Salman Khan Films         8.1
8   Bollywood         Vinod Chopra Films         8.4
9   Bollywood   Vinod Chopra Productions         8.1
10  Bollywood             Yash Raj Films         8.0
11  Bollywood                Zee Studios         8.3
12  Hollywood                                    8.5
13  Hollywood           20th Century Fox         7.8
14  Hollywood  Castle Rock Entertainment         9.3
15  Hollywood          Columbia Pictures         8.0
16  Hollywood              Liberty Films         8.6
17  Hollywood             Marvel Studios         8.4
18  Hollywood         Paramount Pictures         9.2
19  Hollywood                    Syncopy         9.0
20  Hollywood         Universal Pictures         9.0
21  Hollywood       Universal Pictures           8.5
22  Hollywood      Warner Bros. Pictures         8.6
23  Bollywood                                 1008.3
24  Bollywood           Arka Media Works      1008.0
25  Bollywood          DVV Entertainment      1008.0
26  Bollywood         Dharma Productions      1008.4
27  Bollywood  Government of West Bengal      1008.3
28  Bollywood              Hombale Films      1008.4
29  Bollywood        Mythri Movie Makers      1007.6
30  Bollywood          Salman Khan Films      1008.1
31  Bollywood         Vinod Chopra Films      1008.4
32  Bollywood   Vinod Chopra Productions      1008.1
33  Bollywood             Yash Raj Films      1008.0
34  Bollywood                Zee Studios      1008.3
35  Hollywood                                 1008.5
36  Hollywood           20th Century Fox      1007.8
37  Hollywood  Castle Rock Entertainment      1009.3
38  Hollywood          Columbia Pictures      1008.0
39  Hollywood              Liberty Films      1008.6
40  Hollywood             Marvel Studios      1008.4
41  Hollywood         Paramount Pictures      1009.2
42  Hollywood                    Syncopy      1009.0
43  Hollywood         Universal Pictures      1009.0
44  Hollywood       Universal Pictures        1008.5
45  Hollywood      Warner Bros. Pictures      1008.6

# Example 2

In [11]:
import datetime as dt
import pandas as pd
from sqlalchemy import create_engine

# Create SQLAlchemy engine
engine = create_engine('mysql+pymysql://root:Admin260@localhost/moviesdb')

# Assuming 'max_rated_studio' is a DataFrame containing the data from the 'max_rated_studio' table
max_rated_studio['create_date'] = dt.datetime.now()

# Replace the data in the 'max_rated_studio' table with the updated DataFrame
max_rated_studio.to_sql('max_rated_studio', engine, index=False, if_exists='replace')

23

In [12]:
# Read the data from the 'max_rated_studio' table in the database
max_sql_query = pd.read_sql('select * from max_rated_studio', engine)

# Check the frequency of values in the 'create_date' column
max_sql_query['create_date'].value_counts()

create_date
2024-03-17 03:14:03    23
Name: count, dtype: int64

# Example 3

In [19]:
import datetime as dt
import pandas as pd
from sqlalchemy import create_engine

# Create SQLAlchemy engine
engine = create_engine('mysql+pymysql://root:Admin260@localhost/moviesdb')

# Assuming 'max_rated_studio' is a DataFrame containing the data from the 'max_rated_studio' table
max_rated_studio['create_date'] = dt.datetime.now()

# Replace the data in the 'max_rated_studio' table with the updated DataFrame
max_rated_studio.to_sql('max_rated_studio', engine, index=False, if_exists='append')

23

In [20]:
# Read the data from the 'max_rated_studio' table in the database
max_sql_query = pd.read_sql('select * from max_rated_studio', engine)

# Check the frequency of values in the 'create_date' column
max_sql_query['create_date'].value_counts()

create_date
2024-03-17 03:14:03    46
2024-03-17 03:14:18    23
2024-03-17 03:14:22    23
2024-03-17 03:14:29    23
Name: count, dtype: int64

# Done !!